var bao = bao || {};

bao.go = bao.go || {};

bao.go.playerRanking = (() => {
  var cols = [
    { title: '棋手', type: 'string', align: 'center'}, 
    { title: '冠军', type: 'number', decimal: 0, align: 'right'}, 
    { title: '亚军', type: 'number', decimal: 0, align: 'right'}, 
    { title: '四强', type: 'number', decimal: 0, align: 'right'}, 
    { title: '八强', type: 'number', decimal: 0, align: 'right'}, 
    { title: '积分', type: 'number', decimal: 2, align: 'right'}
  ],
      data = [
    ['李昌镐', 17, 11, 13, 11],
    ['李世石', 14, 5, 5, 12],
    ['曹薰铉', 9, 2, 9, 12],
    ['刘昌赫', 6, 7, 5, 10],
    ['古力', 8, 4, 3, 8],
    ['常昊', 3, 8, 4, 13],
    ['马晓春', 2, 6, 5, 13],
    ['赵治勋', 2, 1, 8, 14],
    ['孔杰', 3, 2, 4, 9],
    ['朴永训', 2, 2, 5, 12],
    ['王立诚', 2, 3, 2, 7],
    ['朴廷桓', 2, 1, 6, 4],
    ['崔哲瀚', 1, 2, 6, 8],
    ['林海峰', 1, 3, 4, 7],
    ['依田纪基', 1, 3, 3, 4],
    ['周鹤洋', 0, 2, 4, 13],
    ['陈耀烨', 1, 2, 3, 6],
    ['俞斌', 1, 1, 4, 6],
    ['朴文垚', 1, 1, 4, 6],
    ['小林光一', 1, 1, 4, 5],
    ['周睿羊', 1, 2, 2, 4],
    ['金志锡', 1, 1, 3, 6],
    ['张栩', 1, 1, 2, 7],
    ['聂卫平', 0, 3, 3, 3],
    ['元晟溱', 1, 1, 2, 5],
    ['胡耀宇', 0, 1, 6, 5],
    ['小林觉', 0, 2, 2, 8],
    ['武宫正树', 2, 0, 0, 3],
    ['邱峻', 0, 3, 1, 5],
    ['徐奉洙', 1, 0, 3, 4],
    ['谢赫', 0, 1, 5, 4],
    ['王磊', 0, 1, 2, 7],
    ['唐韦星', 1, 1, 1, 0], 
    ['大竹英雄', 1, 1, 0, 2],
    ['赵汉乘', 0, 1, 4, 2],
    ['江维杰', 1, 0, 2, 1],
    ['时越', 1, 0, 2, 1],
    ['周俊勋', 1, 0, 1, 3],
    ['姜东润', 1, 0, 1, 3],
    ['罗洗河', 1, 0, 1, 2],
    ['宋泰坤', 0, 1, 3, 2],
    ['朴正祥', 1, 0, 0, 3],
    ['崔明勋', 0, 1, 3, 1],
    ['白洪淅', 1, 0, 1, 0],
    ['范廷钰', 1, 0, 0, 2], 
    ['许映皓', 0, 1, 2, 2],
    ['王檄', 0, 1, 1, 4],
    ['芈昱廷', 1, 0, 0, 1],
    ['柁嘉熹', 1, 0, 0, 1],
    ['刘小光', 0, 0, 2, 5],
    ['王铭琬', 0, 0, 2, 5],
    ['柯洁', 1, 0, 0, 0],
    ['睦镇硕', 0, 1, 1, 2],
    ['山田规三生', 0, 1, 1, 2],
    ['彭荃', 0, 0, 3, 2],
    ['加藤正夫', 0, 0, 1, 5],
    ['钱宇平', 0, 1, 0, 2],
    ['党毅飞', 0, 1, 0, 2],
    ['黄弈中', 0, 0, 2, 2],
    ['韩尚勋', 0, 1, 0, 1],
    ['羽根直树', 0, 1, 0, 1],
    ['梁宰豪', 0, 0, 2, 1],
    ['柳时熏', 0, 0, 2, 1],
    ['彦坂直人', 0, 0, 2, 1],
    ['刘星', 0, 0, 2, 1],
    ['芮乃伟', 0, 0, 1, 3],
    ['赵善津', 0, 1, 0, 0],
    ['淡路修三', 0, 0, 1, 2],
    ['金承俊', 0, 0, 1, 2],
    ['李圣宰', 0, 0, 0, 4],
    ['河野临', 0, 0, 0, 4],
    ['山下敬吾', 0, 0, 0, 4],
    ['山城宏', 0, 0, 1, 1],
    ['邵炜刚', 0, 0, 1, 1],
    ['藤泽秀行', 0, 0, 1, 1],
    ['王煜辉', 0, 0, 1, 1],
    ['王垚', 0, 0, 1, 1],
    ['罗玄', 0, 0, 1, 1], 
    ['邬光亚', 0, 0, 1, 1],
    ['井山裕太', 0, 0, 1, 1],
    ['李喆', 0, 0, 1, 1],
    ['谢尔豪', 0, 0, 1, 1], 
    ['结成聪', 0, 0, 0, 3],
    ['迈克雷蒙', 0, 0, 0, 3],
    ['洪旼杓', 0, 0, 1, 0],
    ['金荣桓', 0, 0, 1, 0],
    ['温昭珍', 0, 0, 1, 0],
    ['金起用', 0, 0, 1, 0],
    ['孟泰龄', 0, 0, 1, 0],
    ['古灵益', 0, 0, 1, 0],
    ['安国铉', 0, 0, 1, 0],
    ['曹大元', 0, 0, 0, 2],
    ['车敏洙', 0, 0, 0, 2],
    ['江铸久', 0, 0, 0, 2],
    ['姜至省', 0, 0, 0, 2],
    ['片刚聪', 0, 0, 0, 2],
    ['石田芳夫', 0, 0, 0, 2],
    ['安祚永', 0, 0, 0, 2],
    ['李映九', 0, 0, 0, 2],
    ['李康', 0, 0, 0, 2], 
    ['连笑', 0, 0, 0, 2],
    ['高尾绅路', 0, 0, 0, 2],
    ['阿基鲁尔', 0, 0, 0, 1],
    ['安达勋', 0, 0, 0, 1],
    ['白石裕', 0, 0, 0, 1],
    ['车泽武', 0, 0, 0, 1],
    ['工藤纪夫', 0, 0, 0, 1],
    ['华学明', 0, 0, 0, 1],
    ['金成龙', 0, 0, 0, 1],
    ['金明完', 0, 0, 0, 1],
    ['金秀壮', 0, 0, 0, 1],
    ['金主镐', 0, 0, 0, 1],
    ['刘菁', 0, 0, 0, 1],
    ['张文东', 0, 0, 0, 1],
    ['金炯佑', 0, 0, 0, 1],
    ['韩雄奎', 0, 0, 0, 1],
    ['丁伟', 0, 0, 0, 1],
    ['牛雨田', 0, 0, 0, 1],
    ['王雷', 0, 0, 0, 1],
    ['坂井秀至', 0, 0, 0, 1],
    ['钟文靖', 0, 0, 0, 1],
    ['陈诗渊', 0, 0, 0, 1],
    ['周贺玺', 0, 0, 0, 1],
    ['檀啸', 0, 0, 0, 1],
    ['安成浚', 0, 0, 0, 1],
    ['夏晨琨', 0, 0, 0, 1],
    ['李钦诚', 0, 0, 0, 1],
    ['戎毅', 0, 0, 0, 1],
    ['陈时映', 0, 0, 0, 1]
  ];

  data.forEach( row => {
    var score = 8.07 * row[1] + 4.03 * row[2] + 2.01 * row[3] + row[4];
    row.push(score);
  });

  return {
    cols : cols,
    data : data
  };
})();

bao.go.countryRanking = (() => {
  var cols = [
    { title: '国家', type: 'string', align: 'right'}, 
    { title: '冠军', type: 'number', decimal: 0, align: 'right'},
    { title: '亚军', type: 'number', decimal: 0, align: 'right'},
    { title: '四强', type: 'number', decimal: 0, align: 'right'},
    { title: '八强', type: 'number', decimal: 0, align: 'right'},
    { title: '棋手', type: 'number', decimal: 0, align: 'right'},
    { title: '积分', type: 'number', decimal: 2, align: 'right'}
  ],
      data = [
    ['中', 29, 41, 76, 162, 57],
    ['日', 11, 18, 37, 97, 29],
    ['韩', 57, 38, 81, 125, 41],
    ['其他', 0, 0, 0, 4, 2]
  ];

  data.forEach( row => {
    var score = 8.07 * row[1] + 4.03 * row[2] + 2.01 * row[3] + row[4];
    row.push(score);
  });

  return {
    cols : cols,
    data : data
  }
})();
