var bao = bao || {};

bao.go = bao.go || {};

bao.go.chunlanTop8 = {
  cols : bao.go.top8TableHeaders,
  data : [
    [1, 1999, '曹薰铉', '李昌镐', '崔明勋', '常昊', '周鹤洋', '依田纪基', '王立诚', '刘昌赫'],
    [2, 2000, '王立诚', '马晓春', '孔杰', '依田纪基', '常昊', '曹薰铉', '周鹤洋', '彭荃'],
    [3, 2001, '刘昌赫', '王立诚', '曹薰铉', '王磊', '孔杰', '周鹤洋', '俞斌', '马晓春'],
    [4, 2003, '李昌镐', '羽根直树', '罗洗河', '常昊', '周鹤洋', '张栩', '曹薰铉', '结成聪'],
    [5, 2005, '李昌镐', '周鹤洋', '彭荃', '胡耀宇', '常昊', '张栩', '古力', '王磊'],
    [6, 2007, '古力', '常昊', '谢赫', '彭荃', '李昌镐', '李世石', '胡耀宇', '周鹤洋'],
    [7, 2009, '常昊', '李昌镐', '周鹤洋', '孔杰', '黄奕中', '谢赫', '古力', '丁伟'],
    [8, 2011, '李世石', '谢赫', '古灵益', '许映皓', '王檄', '古力', '赵治勋', '孔杰'],
    [9, 2013, '陈耀烨', '李世石', '江维杰', '孔杰', '朴廷桓', '元晟溱', '朴文垚', '金志锡'],
    [10, 2015, '古力', '周睿羊', '金志锡', '陈耀烨', '张栩', '芈昱廷', '时越', '朴廷桓'],
    [11, 2017, '檀啸', '朴永训', '柯洁', '辜梓豪', '柁嘉熹', '连笑', '芈昱廷', '金志锡'],
    [12, 2019, '朴廷桓', '朴永训', '柯洁', '党毅飞', '谢科', '辜梓豪', '金志锡', '陈耀烨'],
    //[13, 2021, '', '', '', '', '', '', '', ''],
  ]
};
