var bao = bao || {};

bao.go = bao.go || {};

bao.go.tongyangTop8 = {
  cols : bao.go.top8TableHeaders,
  data : [
    [3, 1992, '李昌镐', '林海峰', '曹薰铉', '赵治勋', '钱宇平', '聂卫平', '淡路修三', '片冈聪'],
    [4, 1993, '李昌镐', '赵治勋', '曹薰铉', '聂卫平', '刘昌赫', '马晓春', '金秀壮', '林海峰'],
    [5, 1994, '曹薰铉', '依田纪基', '聂卫平', '刘昌赫', '迈克·雷蒙', '赵治勋', '林海峰', '马晓春'],
    [6, 1995, '马晓春', '聂卫平', '曹薰铉', '山城宏', '王立诚', '钱宇平', '依田纪基', '赵治勋'],
    [7, 1996, '李昌镐', '马晓春', '赵治勋', '曹薰铉', '刘小光', '聂卫平', '小林觉', '片冈聪'],
    [8, 1997, '曹薰铉', '小林觉', '金荣桓', '李昌镐', '王磊', '柳时熏', '赵治勋', '马晓春'],
    [9, 1998, '李昌镐', '刘昌赫', '俞斌', '柳时熏', '林海峰', '迈克·雷蒙', '赵治勋', '李圣宰']
  ]
};
