var bao = bao || {};

bao.go = bao.go || {};

bao.go.ingTop8 = {
  cols : bao.go.top8TableHeaders,
  data : [
    [1, 1989, '曹薰铉', '聂卫平', '林海峰', '藤泽秀行', '小林光一', '江铸久', '赵治勋', '加藤正夫'],
    [2, 1993, '徐奉洙', '大竹英雄', '赵治勋', '芮乃伟', '武宫正树', '淡路修三', '林海峰', '梁宰豪'],
    [3, 1996, '刘昌赫', '依田纪基', '林海峰', '赵治勋', '李昌镐', '武宫正树', '曹薰铉', '马晓春'],
    [4, 2001, '李昌镐', '常昊', '俞斌 ', '王铭琬', '依田纪基', '大竹英雄', '林海峰', '马晓春'],
    [5, 2005, '常昊', '崔哲瀚', '宋泰坤', '彭荃', '孔杰', '王铭琬', '李昌镐', '周鹤洋'],
    [6, 2009, '崔哲瀚', '李昌镐', '刘星', '李世石', '朴文垚', '朴永训', '赵治勋', '孔杰'],
    [7, 2012, '范廷钰', '朴廷桓', '谢赫', '李昌镐', '檀啸', '古力', '赵治勋', '张栩'],
    [8, 2016, '唐韦星', '朴廷桓', '时越', '李世石', '金志锡', '柯洁', '河野临', '姜东润'],
    //[9, 2020, '', '', '', '', '', '', '', ''],
  ]
};
