var bao = bao || {};

bao.go = bao.go || {};

bao.go.samsungTop8 = {
  cols : bao.go.top8TableHeaders,
  data : [
    [1, 1996, '依田纪基', '刘昌赫', '梁宰豪', '李昌镐', '金成龙', '小林光一', '刘小光', '徐奉洙'],
    [2, 1997, '李昌镐', '小林觉', '马晓春', '金承俊', '彦坂直人', '刘昌赫', '李圣宰', '常昊'],
    [3, 1999, '李昌镐', '马晓春', '赵治勋', '柳时熏', '小林觉', '刘小光', '加藤正夫', '李圣宰'],
    [4, 1999, '李昌镐', '赵善津', '山田规三生', '彦坂直人', '常昊', '金承俊', '王磊', '姜至省'],
    [5, 2000, '刘昌赫', '山田规三生', '梁宰豪', '徐奉洙', '姜至省', '周鹤洋', '芮乃伟', '曹薰铉'],
    [6, 2001, '曹薰铉', '常昊', '马晓春', '李昌镐', '安达勋', '朴正祥', '芮乃伟', '李世石'],
    [7, 2003, '曹薰铉', '王磊', '王煜辉', '胡耀宇', '罗洗河', '常昊', '崔明勋', '曹大元'],
    [8, 2003, '赵治勋', '朴永训', '胡耀宇', '谢赫', '曹薰铉', '李世石', '山田规三生', '李昌镐'],
    [9, 2004, '李世石', '王檄', '古力', '周鹤洋', '王磊', '崔哲瀚', '宋泰坤', '朴永训'],
    [10, 2006, '罗洗河', '李昌镐', '崔哲瀚', '胡耀宇', '李世石', '曹薰铉', '刘昌赫', '金明完'],
    [11, 2007, '常昊', '李昌镐', '徐奉洙', '白洪淅', '崔哲瀚', '王尧', '朴文尧', '俞斌'],
    [12, 2008, '李世石', '朴永训', '黄弈中', '古力', '常昊', '胡耀宇', '韩尚勋', '刘昌赫'],
    [13, 2009, '李世石', '孔杰', '黄奕中', '周睿羊', '李昌镐', '王檄', '山下敬吾', '李喆'],
    [14, 2009, '孔杰', '邱峻', '古力', '李昌镐', '朴永训', '陈耀烨', '许映皓', '周睿羊'],
    [15, 2010, '古力', '许映皓', '金志锡', '朴廷桓', '李世石', '孔杰', '王雷', '元晟溱'],
    [16, 2011, '元晟溱', '古力', '陈耀烨', '罗玄', '朴永训', '李映九', '金志锡', '孔杰'],
    [17, 2012, '李世石', '古力', '崔哲瀚', '朴廷桓', '陈耀烨', '范廷钰', '姜东润', '元晟溱'],
    [18, 2013, '唐韦星', '李世石', '时越', '邬光亚', '金志锡', '朴廷桓', '邱峻', '安成浚'],
    [19, 2014, '金志锡', '唐韦星', '时越', '朴廷桓', '戎毅', '李世石', '姜东润', '周睿羊'],
    [20, 2015, '柯洁', '时越', '李世石', '唐韦星', '卞相壹', '金东昊', '朴廷桓', '张涛'],
    [21, 2016, '柯洁', '柁嘉熹', '李世石', '范蕴若', '周睿羊', '檀啸', '唐韦星', '朴廷桓'],
    [22, 2017, '辜梓豪', '唐韦星', '童梦成', '安国铉', '朴廷桓', '申真谞', '安成浚', '柁嘉熹'],
    [23, 2018, '柯洁', '安国铉', '谢尔豪', '唐韦星', '申真谞', '连笑', '井山裕太', '申旻埈'],
    [24, 2019, '唐韦星', '杨鼎新', '廖元赫', '辜梓豪', '朴廷桓', '陶欣然', '申真谞', '申旻埈'],
    //[25, 2020, '', '', '', '', '', '', '', ''],
  ]

};
