var bao = bao || {};

bao.go = bao.go || {};

bao.go.fujitsuTop8 = {
  cols : bao.go.top8TableHeaders,
  data : [
    [1, 1988, '武宫正树', '林海峰', '聂卫平', '小林光一', '马晓春', '白石裕', '赵治勋', '加藤正夫'],
    [2, 1989, '武宫正树', '林海峰', '曹薰铉', '徐奉洙', '刘小光', '车敏洙', '马晓春', '王铭琬'],
    [3, 1990, '林海峰', '聂卫平', '小林光一', '曹薰铉', '王立诚', '李昌镐', '车敏洙', '山城宏'],
    [4, 1991, '赵治勋', '钱宇平', '王立诚', '小林光一', '马晓春', '迈克·雷蒙', '石田芳夫', '徐奉洙'],
    [5, 1992, '大竹英雄', '王立诚', '马晓春', '刘小光', '聂卫平', '赵治勋', '车泽武', '曹薰铉'],
    [6, 1993, '刘昌赫', '曹薰铉', '加藤正夫', '淡路修三', '大竹英雄', '赵治勋', '小林光一', '邵炜刚'],
    [7, 1994, '曹薰铉', '刘昌赫', '林海峰', '赵治勋', '加藤正夫', '华学明', '小林光一', '张文东'],
    [8, 1995, '马晓春', '小林光一', '刘昌赫', '赵治勋', '林海峰', '俞斌', '曹大元', '小林觉'],
    [9, 1996, '李昌镐', '马晓春', '小林光一', '刘小光', '王铭琬', '常昊', '小林觉', '藤泽秀行'],
    [10, 1997, '小林光一', '王立诚', '周鹤洋', '马晓春', '常昊', '武宫正树', '赵治勋', '林海峰'],
    [11, 1998, '李昌镐', '常昊', '刘昌赫', '彦坂直人', '俞斌', '曹薰铉', '王立诚', '马晓春'],
    [12, 1999, '刘昌赫', '马晓春', '小林觉', '赵治勋', '石田芳夫', '邱峻', '加藤正夫', '李圣宰'],
    [13, 2000, '曹薰铉', '常昊', '小林觉', '睦镇硕', '周鹤洋', '张栩', '刘昌赫', '刘小光'],
    [14, 2001, '曹薰铉', '崔明勋', '林海峰', '周俊勋', '小林光一', '俞斌', '赵治勋', '河野临'],
    [15, 2002, '李世石', '刘昌赫', '李昌镐', '王铭琬', '周俊勋', '小林觉', '孔杰', '朴永训'],
    [16, 2003, '李世石', '宋泰坤', '李昌镐', '依田纪基', '小林觉', '刘昌赫', '高尾绅路', '王立诚'],
    [17, 2004, '朴永训', '依田纪基', '宋泰坤', '刘昌赫', '张栩', '崔哲瀚', '李昌镐', '周俊勋'],
    [18, 2005, '李世石', '崔哲瀚', '刘昌赫', '宋泰坤', '俞斌', '王檄', '王铭琬', '古力'],
    [19, 2006, '朴正祥', '周鹤洋', '崔哲瀚', '李世石', '常昊', '结成聪', '朴永训', '李昌镐'],
    [20, 2007, '朴永训', '李昌镐', '依田纪基', '张栩', '周鹤洋', '王檄', '胡耀宇', '崔哲瀚'],
    [21, 2008, '古力', '李昌镐', '常昊', '刘星', '李世石', '朴永训', '依田纪基', '赵汉乘'],
    [22, 2009, '姜东润', '李昌镐', '朴永训', '常昊', '朴文垚', '河野临', '山下敬吾', '李世石'],
    [23, 2010, '孔杰', '李世石', '邱峻', '朴文垚', '金志锡', '姜东润', '古力', '朴永训'],
    [24, 2011, '朴廷桓', '邱峻', '井山裕太', '江维杰', '朴文垚', '坂井秀至', '李世石', '谢赫']
  ]
};
