var bao = bao || {};

bao.go = bao.go || {};

bao.go.lgTop8 = {
  cols : bao.go.top8TableHeaders,
  data : [
    [1, 1997, '李昌镐', '刘昌赫', '马晓春', '崔明勋', '小林觉', '金承俊', '江铸久', '曹薰铉'],
    [2, 1998, '王立诚', '刘昌赫', '崔明勋', '李昌镐', '曹薰铉', '徐奉洙', '小林觉', '马晓春'],
    [3, 1999, '李昌镐', '马晓春', '邵炜刚', '俞斌  ', '周俊勋', '山田规三生', '赵治勋', '工藤纪夫'],
    [4, 2000, '俞斌', '刘昌赫', '曹薰铉', '李昌镐', '王立诚', '王磊', '常昊', '马晓春'],
    [5, 2001, '李昌镐', '李世石', '王立诚', '周鹤洋', '马晓春', '曹薰铉', '芮乃伟', '徐奉洙'],
    [6, 2002, '刘昌赫', '曹薰铉', '李世石', '李昌镐', '周鹤洋', '睦镇硕', '山下敬吾', '罗洗河'],
    [7, 2003, '李世石', '李昌镐', '赵汉乘', '元晟溱', '朴永训', '曹薰铉', '刘昌赫', '周鹤洋'],
    [8, 2004, '李昌镐', '睦镇硕', '元晟溱', '赵汉乘', '金主镐', '常昊', '王磊', '李世石'],
    [9, 2005, '张栩', '俞斌', '赵汉乘', '李昌镐', '刘昌赫', '孔杰', '元晟溱', '李世石'],
    [10, 2006, '古力', '陈耀烨', '李世石', '朴文尧', '周鹤洋', '王煜辉', '邱峻', '朴正祥'],
    [11, 2007, '周俊勋', '胡耀宇', '洪旼杓', '赵汉乘', '谢赫', '古力', '李昌镐', '陈耀烨'],
    [12, 2008, '李世石', '韩尚勋', '胡耀宇', '温昭珍', '张栩', '朴正祥', '刘菁', '河野临'],
    [13, 2009, '古力', '李世石', '李昌镐', '朴永训', '金炯佑', '山下敬吾', '河野临', '常昊'],
    [14, 2010, '孔杰', '李昌镐', '朴永训', '朴文尧', '崔哲瀚', '胡耀宇', '邱峻', '古力'],
    [15, 2011, '朴文垚', '孔杰', '王垚', '孟泰龄', '崔哲瀚', '李昌镐', '胡耀宇', '安祚永'],
    [16, 2012, '江维杰', '李昌镐', '金志锡', '谢赫', '元晟溱', '邱峻', '陈诗渊', '许映皓'],
    [17, 2013, '时越', '元晟溱', '姜东润', '崔哲瀚', '罗玄', '李康', '李映九', '连笑'],
    [18, 2014, '柁嘉熹', '周睿羊', '李喆', '陈耀烨', '高尾绅路', '夏晨琨', '李钦诚', '井山裕太'],
    [19, 2015, '朴廷桓', '金志锡', '朴永训', '崔哲瀚', '陈耀烨', '谢尔豪', '柁嘉熹', '范廷钰'],
    [20, 2016, '姜东润', '朴永训', '时越', '柁嘉熹', '柯洁', '余正麒', '金志锡', '元晟溱'],
    [21, 2017, '党毅飞', '周睿羊', '申真谞', '朴廷桓', '陈耀烨', '彭立尧', '孟泰龄', '古力'],
    [22, 2018, '谢尔豪', '井山裕太', '江维杰', '柯洁', '崔哲瀚', '杨鼎新', '李元荣', '申真谞'],
    [23, 2019, '杨鼎新', '时越', '申旻埈', '范廷钰', '姜东润', '江维杰', '彭立尧', '朴廷桓'],
    //[24, 2020, '', '', '', '', '', '', '', ''],
  ]
};
